# SketchPlane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveByPoints..::..SketchPlane Property
CurveByPoints Class See Also
---
Override the SketchPlane property of CurveElement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override SketchPlane SketchPlane { get; set; }
```

Visual Basic
---
```text
Public Overrides Property SketchPlane As SketchPlane
	Get
	Set
```

Visual C++
---
```text
public:
virtual property SketchPlane^ SketchPlane {
	SketchPlane^ get () override;
	void set (SketchPlane^ value) override;
}
```

# Remarks
CurveByPoints has no associated SketchPlane. Getting this property returns nullNothingnullptra null reference (Nothing in Visual Basic). Setting it causes an InvalidOperationException.
# See Also
CurveByPoints Class
Autodesk.Revit.DB Namespace